{
  "id": "48d53f7f26ac494aaaf4c6536c2c53ce",
  "content": "Professionals The American Diabetes Association (ADA) convened leading experts, including endocrinologists, researchers, primary care professionals, certified diabetes care and education specialists, and mental health professionals, to understand opportunities and roadblocks to type 1 diabetes screening and awareness. The outcome of this roundtable is a report that outlines the discussion and potential opportunities for future direction. The report does not necessarily reflect official guidelines or recommendations from the American Diabetes Association or other participating organizations. Download Now Image The Honeymoon PhaseSome people with type 1 diabetes have a \"honeymoon\" period, a brief period of time where your body is producing enough insulin to lower blood glucose levels. The honeymoon phase usually happens after you start taking insulin and you may not need as much to manage your blood glucose. Work with your diabetes care team for treatment and care to avoid complications like hypoglycemia. A honeymoon period can last as little as a week or even up to a year. It’s important to know that the absence of symptoms doesn't mean the diabetes is gone. The pancreas will eventually be unable to make enough insulin, and, if untreated, the symptoms will return.Is it Possible You Don't Have Type 2 DiabetesIf you or someone you know is diagnosed with type 2 diabetes but isn’t able to manage it with the typical treatments for type 2 diabetes, it may be worth a visit to an endocrinologist to verify what type of diabetes you have. Generally, this requires antibody tests and possibly the measurement of a C-peptide level. It is important to be sure that your diagnosis is correct because that will determine your treatment plan, allowing you manage your diabetes and prevent its complications. Screening Acceleration Summit Type 1 Diabetes Dr. Fran Cogen Screening Acceleration Summit Type 1 Diabetes Dr. Nuha El Sayed Resources for Type 1 Diabetes Browse these resources for type 1 diabetes. Image People with Diabetes Resources for Living with Type 1 Diabetes Whether you’ve lived with diabetes for a long time, are newly diagnosed, or a caregiver, we have the resources to help you learn about how to navigate life with type 1. Learn More Image People with Diabetes Nutrition Having diabetes doesn’t mean giving up all your favorite foods, it’s about modifying what you love to fit your new lifestyle and help you manage diabetes. Learn More Image People with Diabetes Physical Activity Staying physically active will help you manage your diabetes, improve your mood, and lower your risk for complications. Learn More Image People with Diabetes Diabetes Food Hub® Access thousands of free diabetes-friendly recipes for all meals, occasions, and dietary restrictions—plus nutrition articles that answer common questions people have about eating with diabetes. Learn More Image Advocacy Safe at School® This program helps to ensure children with diabetes receive the care they need at school. Learn More Image People with Diabetes Healthy Living e-newsletter Sign up to receive diabetes-friendly recipes, articles, and more resources delivered directly to your email inbox every month. Learn More Image Health Care Professionals Mental Health Resource Screening for diabetes has a significant emotional and mental health toll. These resources can help you offer support to people you treat and their families. Learn More Image Health Care Professionals Diagnosis and Classification of Type 1 Diabetes Read our Standards of Care in Diabetes—2024 recommendations on type 1 diabetes screening and diagnosis. Learn More Image health care professionals Prevention or Delay of Diabetes Read Standards of Care in Diabetes recommendations on interventions to delay type 1 diabetes. Learn More Image health care professionals Infographics These documents provide at-a-glance guidance for type 1 diabetes screening based on the Standards of Care in Diabetes. Learn More Image health care professionals Latest Innovations and Treatments in Type 1 Diabetes Earn free CE credit in the Institute of Learning. Learn More Image health care professionals School Nurse Resources School nurses play an important role for students with type 1 diabetes and their caregivers. Training resources are available. Learn More Information specialists at the Center for Information are your personal guides to information on diabetes, donation inquiries, as well as American Diabetes Association programs and events.1-800-DIABETES ( 1-800-342-2383 ) Supported in part by: Sanofi Banting Circle Elite Read More Sanofi Banting Circle Elite Sanofi supports phase 3 of ADA’s Therapeutic Inertia program. The main goal of phase 3 is to promote the measurable adoption of evidence-based practices, strategies, programs and tools that address key barriers associated with therapeutic inertia in diabetes care, leading to improved, timely treatment modification and improved overall glycemic control in adult patients with type 2 diabetes. Sanofi also supported the American Diabetes Association’s 100 Years of Insulin, a year-long campaign that focused on awareness, education and promoting activities that build community.View website Give Today and Change lives! With your support, the American Diabetes Association® can continue our lifesaving work to make breakthroughs in research and provide people with the resources they need to fight diabetes. Give Today",
  "metadata": {
    "url": "https://diabetes.org/about-diabetes/type-1",
    "title": "Understanding Type 1 Diabetes | ADA",
    "chunkIndex": 1,
    "totalChunks": 2,
    "contentType": "article",
    "section": "about-diabetes",
    "sourceUrl": "https://diabetes.org/about-diabetes/type-1",
    "sourcePage": "About diabetes > Type 1"
  }
}